---
kind: type
id: T:Autodesk.Revit.DB.FamilySymbolProfile
source: html/9a0976ad-9366-4139-43f1-95e9f3918622.htm
---
# Autodesk.Revit.DB.FamilySymbolProfile

Represents a family symbol based profile for sweep or swept blend elements.

## Syntax (C#)
```csharp
public class FamilySymbolProfile : SweepProfile
```

## Remarks
Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory
to create the profile.